In [1]:
import pandas as pd

In [2]:
selloutData=pd.read_csv("./dataset/kopo_channel_seasonality_new.csv")

In [3]:
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0
2      A60  PRODUCT34    201402   4463.0
3      A60  PRODUCT47    201402      0.0
4      A60  PRODUCT56    201402     23.0

In [4]:
import numpy as np

In [5]:
selloutData["NEW_QTY"]=np.where(selloutData["QTY"]<0,0,selloutData["QTY"])

In [6]:
##53주차 제거

In [6]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
NEW_QTY     float64
dtype: object

In [7]:
selloutData["WEEK"]= selloutData["YEARWEEK"]%100

In [8]:
##selloutData["YEAR"]= round(selloutData["YEARWEEK"]/100

In [9]:
def customFunction(inputColumn): ##YEARWEEK YEAR과 WEEK로 나눌때 round 함수가 데이터를 잘 못읽어서   
    ##inputColumn=201601           ##함수 만들어서 WEEK나누는데 사용
    yearValue=inputColumn/100
    yearValue =int(yearValue)
    return yearValue

In [10]:
## refinedData["YEAR"]=selloutData["YEARWEEK"]/100.astype(int)

In [11]:
selloutData["YEAR"]=selloutData["YEARWEEK"].apply(customFunction)
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014
3      A60  PRODUCT47    201402      0.0      0.0     2  2014
4      A60  PRODUCT56    201402     23.0     23.0     2  2014

In [12]:
refinedData=selloutData[selloutData.WEEK%100<53]

In [13]:
refinedData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014
3      A60  PRODUCT47    201402      0.0      0.0     2  2014
4      A60  PRODUCT56    201402     23.0     23.0     2  2014

In [15]:
int(201623/100)

2016

In [16]:
201623%100

23

In [17]:
##정렬하기

In [14]:
sortKey=["REGIONID","PRODUCT","YEARWEEK"]

In [15]:
sortedData=refinedData.sort_values(sortKey)

In [16]:
step0Data=sortedData.reset_index(drop=True) ##drop=True 해야 그전 인덱스까지 지워지고 새로 인덱스 생성

In [17]:
step0Data.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR
0      A00  PRODUCT34    201401  661.0    661.0     1  2014
1      A00  PRODUCT34    201402  679.0    679.0     2  2014
2      A00  PRODUCT34    201403  578.0    578.0     3  2014
3      A00  PRODUCT34    201404  532.0    532.0     4  2014
4      A00  PRODUCT34    201405  516.0    516.0     5  2014

In [22]:
##기본 이동평균 함수 (롤링 함수 전에는 정렬 필수)

In [18]:
step0Data["MA"]=step0Data.NEW_QTY.rolling(window=15,center=True ,min_periods=1).mean()

In [20]:
step0Data.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR          MA
0      A00  PRODUCT34    201401  661.0    661.0     1  2014  520.000000
1      A00  PRODUCT34    201402  679.0    679.0     2  2014  514.444444
2      A00  PRODUCT34    201403  578.0    578.0     3  2014  516.800000
3      A00  PRODUCT34    201404  532.0    532.0     4  2014  503.363636
4      A00  PRODUCT34    201405  516.0    516.0     5  2014  490.750000

In [ ]:
##step1Data["MA"]=step1Data.NEW_QTY.rolling(window=5,center= False).mean() 
## center = False일때는 내위에 데이터들을 가지고 계산
## center =true 일때는 내가 중심으로

In [21]:
step0Data.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR          MA
0      A00  PRODUCT34    201401  661.0    661.0     1  2014  520.000000
1      A00  PRODUCT34    201402  679.0    679.0     2  2014  514.444444
2      A00  PRODUCT34    201403  578.0    578.0     3  2014  516.800000
3      A00  PRODUCT34    201404  532.0    532.0     4  2014  503.363636
4      A00  PRODUCT34    201405  516.0    516.0     5  2014  490.750000

In [25]:
step0Data.to_csv("./result.csv") ##./현재경로에 저장

In [23]:
##filteredData=step0Data[(step0Data.REGIONID=="A00")&(step0Data.PRODUCT=="PRODUCT34")]

In [24]:
groupKey=["REGIONID","PRODUCT","YEAR"]

In [29]:
groupData=step0Data.groupby(groupKey)[["NEW_QTY"]].mean()
groupData.head()

                            NEW_QTY
REGIONID PRODUCT   YEAR
A00      PRODUCT34 2014  275.961538
                   2015   86.634615
                   2016   36.576923
         PRODUCT58 2014    2.673077
                   2015    5.711538

In [34]:
groupDataResult=groupData.reset_index()

In [36]:
groupDataResult.head()

  REGIONID    PRODUCT  YEAR     NEW_QTY
0      A00  PRODUCT34  2014  275.961538
1      A00  PRODUCT34  2015   86.634615
2      A00  PRODUCT34  2016   36.576923
3      A00  PRODUCT58  2014    2.673077
4      A00  PRODUCT58  2015    5.711538

In [39]:
groupDataResult.columns=["REGIONID","PRODUCT","YEAR","GROUP"]
groupDataResult.head()

  REGIONID    PRODUCT  YEAR       GROUP
0      A00  PRODUCT34  2014  275.961538
1      A00  PRODUCT34  2015   86.634615
2      A00  PRODUCT34  2016   36.576923
3      A00  PRODUCT58  2014    2.673077
4      A00  PRODUCT58  2015    5.711538

In [67]:
step0Data.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR          MA
0      A00  PRODUCT34    201401  661.0    661.0     1  2014  520.000000
1      A00  PRODUCT34    201402  679.0    679.0     2  2014  514.444444
2      A00  PRODUCT34    201403  578.0    578.0     3  2014  516.800000
3      A00  PRODUCT34    201404  532.0    532.0     4  2014  503.363636
4      A00  PRODUCT34    201405  516.0    516.0     5  2014  490.750000

In [68]:
mergeResult=pd.merge(step0Data,groupDataResult,left_on=["REGIONID","PRODUCT","YEAR"],right_on=["REGIONID","PRODUCT","YEAR"])\
[["REGIONID","PRODUCT","YEARWEEK","QTY","NEW_QTY","WEEK","YEAR","MA","GROUP"]]
mergeResult.head() ##데이터합치기

,REGIONID,PRODUCT,YEARWEEK,QTY,NEW_QTY,WEEK,YEAR,MA,GROUP
0,A00,PRODUCT34,201401,661.0,661.0,1,2014,520.000000,275.961538
1,A00,PRODUCT34,201402,679.0,679.0,2,2014,514.444444,275.961538
2,A00,PRODUCT34,201403,578.0,578.0,3,2014,516.800000,275.961538
3,A00,PRODUCT34,201404,532.0,532.0,4,2014,503.363636,275.961538
4,A00,PRODUCT34,201405,516.0,516.0,5,2014,490.750000,275.961538

In [70]:
mergeResult.to_csv("./mergeData.csv")

In [73]:
groupKey=["REGIONID","PRODUCT"]

In [ ]:
###그룹바이함수 만들기

In [76]:
groupDataSet=mergeResult.groupby(groupKey)

In [101]:
def groupRolling(oneGroup):
    ##len(list(groupDataSet.groups))
    ## oneGroup=groupDataSet.get_group(list(groupDataSet.groups)[0])## 일단외운다ㅋㄷ

    indexGroupData=oneGroup.reset_index(drop=True)
    indexGroupData["MA2"]=indexGroupData["NEW_QTY"].rolling(window=5,center=True).mean()
    
    return indexGroupData

In [102]:
finalResult=mergeResult.groupby(groupKey).apply(groupRolling)

In [103]:
finalResult.head()

                     REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  \
REGIONID PRODUCT
A00      PRODUCT34 0      A00  PRODUCT34    201401  661.0    661.0     1
                   1      A00  PRODUCT34    201402  679.0    679.0     2
                   2      A00  PRODUCT34    201403  578.0    578.0     3
                   3      A00  PRODUCT34    201404  532.0    532.0     4
                   4      A00  PRODUCT34    201405  516.0    516.0     5

                      YEAR          MA       GROUP    MA2
REGIONID PRODUCT
A00      PRODUCT34 0  2014  520.000000  275.961538    NaN
                   1  2014  514.444444  275.961538    NaN
                   2  2014  516.800000  275.961538  593.2
                   3  2014  503.363636  275.961538  545.6
                   4  2014  490.750000  275.961538  491.2

In [105]:
finalResult.to_csv("./finalResult.csv")

In [106]:
groupKey=["REGIONID","PRODUCT"]

In [108]:
def groupFunction(eachGroup):
    eachGroup["MA3"]=eachGroup["NEW_QTY"].rolling(window=5,center=True,min_periods=1).mean()
    return eachGroup

In [120]:
mergeResult.groupby(groupKey).apply(groupFunction).head()

,REGIONID,PRODUCT,YEARWEEK,QTY,NEW_QTY,WEEK,YEAR,MA,GROUP,MA3
0,A00,PRODUCT34,201401,661.0,661.0,1,2014,520.000000,275.961538,639.333333
1,A00,PRODUCT34,201402,679.0,679.0,2,2014,514.444444,275.961538,612.500000
2,A00,PRODUCT34,201403,578.0,578.0,3,2014,516.800000,275.961538,593.200000
3,A00,PRODUCT34,201404,532.0,532.0,4,2014,503.363636,275.961538,545.600000
4,A00,PRODUCT34,201405,516.0,516.0,5,2014,490.750000,275.961538,491.200000

In [ ]:
##concat 동일한 컬럼 데이터를 합치는 경우

In [121]:
fullData=pd.read_csv("./dataset/kopo_channel_seasonality_new.csv")

In [122]:
a01Data=fullData[fullData.REGIONID=="A01"]
len(a01Data)

3611

In [123]:
a20Data=fullData[fullData.REGIONID=="A20"]
len(a20Data)

471

In [124]:
resultConcat=pd.concat([a01Data,a20Data],axis=0)

In [125]:
len(resultConcat)

4082